---
kind: method
id: M:Autodesk.Revit.DB.LabelUtils.Dispose
source: html/68b266bc-631e-fc0e-2d8f-e0b03ad72ec7.htm
---
# Autodesk.Revit.DB.LabelUtils.Dispose Method

Releases all resources used by the LabelUtils

## Syntax (C#)
```csharp
public void Dispose()
```